mowglifrenchtouch/mowglinext/firmware/stm32/ros_usbnode/src/drivemotor.c
        /* todo check for timeout */

        break;

    case RX_CRC_ERROR:
    case RX_INVALID_ERROR:
    case RX_TIMEOUT_ERROR:
    default:
        /* inform for error */
        break;
    }
}

/// @brief Decode received drive motor messages
/// @param
void DRIVEMOTOR_App_Rx(void)
{
    if (drivemotors_eRxFlag == RX_VALID)
    {
        /* decode */
        uint8_t direction = drivemotor_psReceivedData.u8_direction;
        // we need to adjust for direction (+/-) !
        if ((direction & 0xc0) == 0xc0)
        {
            left_direction = 1;
        }
        else if ((direction & 0x80) == 0x80)
        {
            left_direction = -1;
        }
        else
        {
            left_direction = 0;
        }
        if ((direction & 0x30) == 0x30)
        {
            right_direction = 1;
        }
        else if ((direction & 0x20) == 0x20)
        {
            right_direction = -1;
        }
        else
        {
            right_direction = 0;
        }

        left_encoder_val = drivemotor_psReceivedData.u16_left_ticks;
        right_encoder_val = drivemotor_psReceivedData.u16_right_ticks;

        // power consumption
        left_power = drivemotor_psReceivedData.u8_left_power;
        right_power = drivemotor_psReceivedData.u8_right_power;

        /*
         * Motor-controller encoder quirk: the 16-bit encoder register can
         * reset to 0 when the wheel's commanded direction changes (and again
         * when the speed crosses from 0 to non-zero). Detect those events
         * and restart the delta window so we don't register a massive phantom
         * jump.
         */
        /*
         * Direction-change fence: when `left_encoder_reset` is true the
         * motor-controller PCB is in the middle of a direction/speed
         * transient and its encoder register may or may not have been
         * zeroed by the controller yet. Rather than GUESS (which the old
         * `prev_left_encoder_val = 0` did, and failed catastrophically
         * when the controller had NOT reset yet: delta_raw =
         * current_encoder_val - 0 = tens of thousands of ticks
         * mistakenly attributed to the new direction, producing
         * ±1000 m/s bogus velocities downstream), we SYNC `prev` to
         * whatever the current encoder value is. Delta for this one
         * packet is then 0 — we concede up to ~21 ms of fine-grained
         * odometry tracking during the transient, which at 0.5 m/s max
         * is 10 mm — in exchange for never emitting a bogus tick-burst
         * on direction change.
         *
         * Subsequent packets compute deltas against the post-transient
         * baseline, so the rest of the trajectory is uncorrupted.
         */
        left_wheel_speed_val = left_direction * drivemotor_psReceivedData.u8_left_speed;
        const uint8_t left_encoder_reset =
            (left_direction == 0) ||
            (left_direction != prev_left_direction) ||
            (prev_left_wheel_speed_val == 0 && left_wheel_speed_val != 0);
        if (left_encoder_reset)
        {
            prev_left_encoder_val = left_encoder_val;  /* sync, not zero */
        }

        /* Encoder register wraps around 0xFFFF; the delta is computed as an
         * unsigned subtraction (natural wrap handling) provided the wheel
         * hasn't spun >32768 ticks in one 20 ms sample (~100 m/s — impossible
         * for a mower).
         */
        const uint16_t left_delta_raw = left_encoder_val - prev_left_encoder_val;
        /* Legacy cumulative counter (unsigned-abs) kept for any existing
         * consumer that still expects monotonic positive ticks. New code
         * should use left_ticks_signed. */
        left_encoder_ticks += (uint32_t)left_delta_raw;
        /* Signed cumulative count — polarity lives in the sign, no need for
         * a separate direction byte downstream. */
        left_ticks_signed += (int32_t)left_delta_raw * (int32_t)left_direction;
        prev_left_encoder_val = left_encoder_val;
        prev_left_wheel_speed_val = left_wheel_speed_val;
        prev_left_direction = left_direction;

        /* Same fence for the right wheel — direction-change transient is
         * per-wheel on a differential-drive platform (e.g. an in-place
         * pivot has left and right transitions at different times). */
        right_wheel_speed_val = right_direction * drivemotor_psReceivedData.u8_right_speed;
        const uint8_t right_encoder_reset =
            (right_direction == 0) ||
            (right_direction != prev_right_direction) ||
            (prev_right_wheel_speed_val == 0 && right_wheel_speed_val != 0);
        if (right_encoder_reset)
        {
            prev_right_encoder_val = right_encoder_val;  /* sync, not zero */
        }
        const uint16_t right_delta_raw = right_encoder_val - prev_right_encoder_val;
        right_encoder_ticks += (uint32_t)right_delta_raw;
        right_ticks_signed += (int32_t)right_delta_raw * (int32_t)right_direction;
        prev_right_encoder_val = right_encoder_val;
        prev_right_wheel_speed_val = right_wheel_speed_val;
        prev_right_direction = right_direction;

        wheelTicks_handler(left_ticks_signed, right_ticks_signed,
                           left_wheel_speed_val, right_wheel_speed_val);

        drivemotors_eRxFlag = RX_WAIT; // ready for next message
    }
}

/**
 * @brief  Sub-deadband chopper: when |cmd| is below PWM_DEADBAND but
 *         non-zero, turn it into an on/off pulse train at the 100 Hz
 *         motor-control tick rate with duty cycle = |cmd| / PWM_DEADBAND,
 *         so the time-average wheel output matches the commanded speed
 *         instead of snapping to the deadband floor. Uses a Bresenham-
 *         style DDA accumulator for exact long-term average.
 *
 *         Above the deadband the command passes through unchanged and
 *         the accumulator is reset (so a transition |cmd| ≥ deadband
 *         → |cmd| < deadband does not carry stale phase).
 *
 *         Must be called EXACTLY ONCE per 10 ms tick per wheel, right
 *         before the message is queued to the motor controller.
 */
__STATIC_INLINE int16_t drivemotor_deadband_chop(int16_t pwm, int16_t *acc)
{
    if (pwm == 0) { *acc = 0; return 0; }
    int16_t abs_pwm = (pwm > 0) ? pwm : -pwm;
    if (abs_pwm >= PWM_DEADBAND) { *acc = 0; return pwm; }
    /* Sub-deadband: integrate commanded magnitude; emit ±PWM_DEADBAND
     * when we've accumulated one deadband's worth, else zero. */
    *acc += abs_pwm;
    if (*acc >= PWM_DEADBAND) {
        *acc -= PWM_DEADBAND;
        return (pwm > 0) ? PWM_DEADBAND : -PWM_DEADBAND;
    }
    return 0;
}

/**
 * @brief  Store the signed PWM command from the cmd_vel handler. The
 *         stored value is kept RAW (no deadband promotion); the chopper
 *         in DRIVEMOTOR_App_10ms() converts sub-deadband magnitudes
 *         into a duty-cycled pulse train at the motor-control tick rate.
 *
 *         Single scalar per wheel encodes both magnitude and direction:
 *         positive = forward, negative = reverse, 0 = stop.
 *
 *         Saturates to ±255 so the downstream 8-bit motor-controller
 *         magnitude field can't overflow.
 *
 * @param  left_pwm_signed   signed PWM command for the left wheel
 * @param  right_pwm_signed  signed PWM command for the right wheel
 */
void DRIVEMOTOR_SetSpeedSigned(int16_t left_pwm_signed, int16_t right_pwm_signed)
{
    /* Saturate to the 8-bit motor-controller magnitude. */
    if (left_pwm_signed  >  255) left_pwm_signed  =  255;
    if (left_pwm_signed  < -255) left_pwm_signed  = -255;
    if (right_pwm_signed >  255) right_pwm_signed =  255;
    if (right_pwm_signed < -255) right_pwm_signed = -255;

    left_pwm_cmd_raw  = left_pwm_signed;
    right_pwm_cmd_raw = right_pwm_signed;
}

/**
 * @brief  Legacy 4-argument form kept as a thin shim over the signed API so
 *         any caller that still uses `(speed, speed, dir, dir)` keeps
 *         working. New code should call DRIVEMOTOR_SetSpeedSigned directly.
 */
void DRIVEMOTOR_SetSpeed(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{
    const int16_t l_signed = left_dir  ? (int16_t)left_speed  : -(int16_t)left_speed;
    const int16_t r_signed = right_dir ? (int16_t)right_speed : -(int16_t)right_speed;
    /* If both speeds are 0, the deadband path passes 0 through unchanged,
     * matching the old "0,0,0,0 == stop" contract. */
    DRIVEMOTOR_SetSpeedSigned(
        (left_speed  == 0) ? 0 : l_signed,
        (right_speed == 0) ? 0 : r_signed);
}

/// @brief drive motor receive interrupt handler
/// @param
void DRIVEMOTOR_ReceiveIT(void)
{
    /* decode the frame */
    if (memcmp(drivemotor_pcu8Preamble, (uint8_t *)&drivemotor_psReceivedData, 5) == 0)
    {
        uint8_t l_u8crc = crcCalc((uint8_t *)&drivemotor_psReceivedData, DRIVEMOTOR_LENGTH_RECEIVED_MSG - 1);
        if (drivemotor_psReceivedData.u8_CRC == l_u8crc)
        {
            drivemotors_eRxFlag = RX_VALID;
        }
        else
        {
            drivemotors_eRxFlag = RX_CRC_ERROR;
        }
    }
    else
    {
        drivemotors_eRxFlag = RX_INVALID_ERROR;
    }
}

/******************************************************************************
 *  Private Functions
 *******************************************************************************/

__STATIC_INLINE void drivemotor_prepareMsg(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{

    uint8_t direction = 0x0;

    // calc direction bits
    if (right_dir == 1)
    {
        direction |= (0x20 + 0x10);
    }
    else
    {
        direction |= 0x20;
    }
    if (left_dir == 1)
    {
        direction |= (0x40 + 0x80);
    }
    else
    {
        direction |= 0x80;
    }

    drivemotor_pu8RqstMessage[0] = 0x55;
    drivemotor_pu8RqstMessage[1] = 0xaa;
    drivemotor_pu8RqstMessage[2] = 0x08;
    drivemotor_pu8RqstMessage[3] = 0x10;
    drivemotor_pu8RqstMessage[4] = 0x80;
    drivemotor_pu8RqstMessage[5] = direction;
    drivemotor_pu8RqstMessage[6] = left_speed;
    drivemotor_pu8RqstMessage[7] = right_speed;
    drivemotor_pu8RqstMessage[9] = 0;
    drivemotor_pu8RqstMessage[8] = 0;
    drivemotor_pu8RqstMessage[10] = 0;
    drivemotor_pu8RqstMessage[11] = crcCalc(drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG - 1);
}
